## Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("services.csv")

In [5]:
df.head(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN

In [6]:
df.tail(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
20,21,21,NaN,NaN,NaN,By phone during business hours.,NaN,just a test service,NaN,NaN,...,NaN,NaN,NaN,Service for Admin Test Location,NaN,San Mateo County,inactive,NaN,NaN,NaN
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [7]:
df.dtypes

id                           int64
location_id                  int64
program_id                 float64
accepted_payments           object
alternate_name              object
application_process         object
audience                    object
description                 object
eligibility                 object
email                       object
fees                        object
funding_sources             object
interpretation_services     object
keywords                    object
languages                   object
name                        object
required_documents          object
service_areas               object
status                      object
wait_time                   object
website                     object
taxonomy_ids                object
dtype: object

In [8]:
df.shape

(23, 22)

In [9]:
df.describe()

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [4]:
def reindex_dataframe(df):
    new_index = range(1, len(df)+1, 2)
    df = df.reindex(new_index)
    return df

In [5]:
df = pd.DataFrame({'A': ['X', 'Y', 'Z', 'A','B','C'], 'B': [True, False,True, True, True, False], 'C': [1, 2, 3, 4, 5, 6]})

In [6]:
df

   A      B  C
0  X   True  1
1  Y  False  2
2  Z   True  3
3  A   True  4
4  B   True  5
5  C  False  6

In [7]:
reindex_dataframe(df)

   A      B  C
1  Y  False  2
3  A   True  4
5  C  False  6

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [8]:
def sum_first_three_values(df):
    values = df['Values'].values
    sum_of_first_three = sum(values[:3]) 
    print(f"The sum of the first three values is {sum_of_first_three}")

In [9]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

In [10]:
sum_first_three_values(df)

The sum of the first three values is 60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
def add_word_count_column(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))
    return df['Word_Count']

In [18]:
df = pd.DataFrame({'Text': ['This is a sentence.', 'Here is another sentence with more words.']})

In [19]:
add_word_count_column(df)

0    4
1    7
Name: Word_Count, dtype: int64

In [20]:
df

                                        Text  Word_Count
0                        This is a sentence.           4
1  Here is another sentence with more words.           7

## Q5. How are DataFrame.size() and DataFrame.shape() different?

Both DataFrame.size and DataFrame.shape are attributes of a Pandas DataFrame, but they return different values.
1. DataFrame.size returns the total number of elements in the DataFrame, which is the product of the number of rows and columns. It is equivalent to the size of the underlying NumPy array.

2. DataFrame.shape returns a tuple containing the number of rows and columns in the DataFrame, respectively. It is a convenient way to check the dimensions of the DataFrame.

## Q6. Which function of pandas do we use to read an excel file?

To read an Excel file in Pandas, we can use the read_excel() function. This function is part of the Pandas IO tools and can read data from Excel files with various extensions like .xlsx, .xls, and .xlsm.

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column n 'Username' in df that contains only the username part of each email address.

In [34]:
def extract_username(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df['Username']

In [35]:
df = pd.DataFrame({'Email':['pranjal@gmail.com','aditi1@test.in','krunal102@apple.com','kritika.pandey@rediffmail.com','ananya.more3@sample.com']})
df

                           Email
0              pranjal@gmail.com
1                 aditi1@test.in
2            krunal102@apple.com
3  kritika.pandey@rediffmail.com
4        ananya.more3@sample.com

In [36]:
extract_username(df)

0           pranjal
1            aditi1
2         krunal102
3    kritika.pandey
4      ananya.more3
Name: Username, dtype: object

In [27]:
df

                           Email        Username
0              pranjal@gmail.com         pranjal
1                 aditi1@test.in          aditi1
2            krunal102@apple.com       krunal102
3  kritika.pandey@rediffmail.com  kritika.pandey
4        ananya.more3@sample.com    ananya.more3

In [43]:
df = pd.DataFrame({"email":['pranjal@gmail.com', 'hanu@gmail.com', 'bro123@gmail.com', 'alexa23@gmail.com']})
df

               email
0  pranjal@gmail.com
1     hanu@gmail.com
2   bro123@gmail.com
3  alexa23@gmail.com

In [44]:
df['email'].str.split('@')[0]

['pranjal', 'gmail.com']

In [46]:
df['newmail'] = df['email'].str.split('@').str[0]
df

               email  newmail
0  pranjal@gmail.com  pranjal
1     hanu@gmail.com     hanu
2   bro123@gmail.com   bro123
3  alexa23@gmail.com  alexa23

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [51]:
def select_rows(df):
    return df[(df["A"]>5) & (df["B"]<10)]

In [52]:
df = pd.DataFrame({'A':[3,8,6,2,9], 'B':[5,2,9,3,1], 'C':[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [54]:
select_rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [56]:
def cal_stats(df):
    mean = df['values'].mean()
    median = df['values'].median()
    std = df['values'].std()
    return mean, median, std

In [59]:
df=pd.DataFrame({'values':[11, 18, 36, 45, 67]})
df

   values
0      11
1      18
2      36
3      45
4      67

In [61]:
mean, med, std = cal_stats(df)
print(f"Mean : {mean}, \nMedian : {med}, \nStandard Deviation : {std}")

Mean : 35.4,
Median : 36.0,
Standard Deviation : 22.30022421411946

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [63]:
def add_moving_average_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values(by='Date')
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [64]:
df = pd.DataFrame({
    'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
    'Sales': [11, 15, 35, 41, 42, 64, 72, 51, 65, 81, 95, 111]
})

In [65]:
add_moving_average_column(df)

         Date  Sales  MovingAverage
0  2022-01-01     11      11.000000
1  2022-01-02     15      13.000000
2  2022-01-03     35      20.333333
3  2022-01-04     41      25.500000
4  2022-01-05     42      28.800000
5  2022-01-06     64      34.666667
6  2022-01-07     72      40.000000
7  2022-01-08     51      45.714286
8  2022-01-09     65      52.857143
9  2022-01-10     81      59.428571
10 2022-01-11     95      67.142857
11 2022-01-12    111      77.000000

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [68]:
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [69]:
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [70]:
add_weekday_column(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [72]:
def filter_date_range(df):
    df['Date'] = pd.to_datetime(df['Date'])
    selected_rows = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return selected_rows

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [74]:
import pandas as pd